CREATE TABLE message(
                        id UUID primary key,
                        topic_id UUID not null REFERENCES topic(id),
                        text varchar(10000) not null,
                        user_creator_id UUID REFERENCES users(id),
                        user_creator_nickname varchar(100) not null,
                        creation_date timestamp not null
);

INSERT INTO message (id, topic_id, text, user_creator_id, user_creator_nickname, creation_date)
VALUES
    ('01e5d538-3984-4ab2-ba10-6da54b8fec4c', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Привет',                  '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-02-05 09:00:00'),
    ('7d51b927-dc82-4560-a4ba-f63d4030a129', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Очень остроумное сообщение',                  '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-02-05 09:01:00'),
    ('17ffdc36-d407-46be-ac56-32e0408309c4', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Хочу пиццу',                  '8513be2f-c6bd-4ffd-83ef-d03773756e53', 'Cobron', '2024-02-05 09:02:00'),
    ('4ddd9267-c165-4df4-8d7c-c3ca50026ddb', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Анекдот',                  '8513be2f-c6bd-4ffd-83ef-d03773756e53', 'Cobron', '2024-02-05 09:03:00'),
    ('9e628322-a0fe-4f09-bfd3-f67acc2194f3', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Зомби',                  '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-02-05 09:04:00'),
    ('aaa3105f-95fd-41fc-bd30-089826b03253', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Решающее дерево',                  '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-02-05 09:05:00'),
    ('8bfe6e1b-980d-4372-9d21-c48c34ab1374', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Пока пока',                  '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-02-05 09:06:00'),

    ('12d657a2-db98-460e-bca2-739ec1478cc4', 'f77ec6e2-b02d-454d-abc8-8cca147acb7c', 'Как дела',                '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-02-22 09:00:00'),
    ('d0ea02b8-236f-4cf2-bd35-b9e784eb2439', '3596ee2c-59d8-4c0c-ac31-a70953800ea0', 'Делаю джаву',             '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-02-08 09:00:00'),
    ('184dc794-942a-4583-ba03-5160ba866a0a', '1d14a6e7-a3bc-426c-bfd0-51f8bb846024', 'Купил 10 литров колы',    '8513be2f-c6bd-4ffd-83ef-d03773756e53', 'Cobron', '2024-02-01 09:00:00'),
    ('1ec9b48c-dd26-4d3e-a838-6a50a546c864', '7f41b9cc-f176-4d17-8f24-f2f3f9c5d116', 'Открыл бизнес',           '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-02-10 09:00:00'),
    ('d3cbc10c-a657-4f9d-993b-32656f21eb2a', '6efc4424-ffcb-4cf5-84f1-4d78dfac6eb5', 'Я инвестор',              '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-02-15 09:00:00'),
    ('b1f87ed5-9f3c-4e95-83e2-cb0f57282855', '785b217e-32ae-40e0-b6b5-96a67435cf57', 'Здравствуйте',            '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-02-20 09:00:00'),
    ('d187d172-4054-49e5-9f61-bae1524ecf49', 'dbbf8a89-0fd1-4c87-b1ae-84724d845775', 'Как вы',                  '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-03-05 09:00:00'),
    ('027684c5-3fa5-48f3-96ac-f7a04161543c', 'b8e4f857-b3eb-4e68-b4a7-3b4ba50f6cc0', 'Продолжайте',             '8513be2f-c6bd-4ffd-83ef-d03773756e53', 'Cobron', '2024-03-10 09:00:00'),
    ('b267a3c1-7a78-4c8f-ace7-b0d68372a7a3', '37f6f234-3786-49ad-8603-057a148b85da', 'Удачи',                   '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-03-15 09:00:00'),
    ('7d124c9f-9e47-4a7a-927e-7552e59b9167', 'f2ec2684-b8c8-41f7-aa44-cf28e71771b7', 'Уверен, что получится',   '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-03-20 09:00:00'),
    ('71e4f6a6-1c12-42cc-bc27-4562347e0716', '4c6a95eb-7429-4be7-b460-74ab9f07ee58', 'Не сомневайтесь',         '8513be2f-c6bd-4ffd-83ef-d03773756e53', 'Cobron', '2024-03-25 09:00:00'),
    ('5be18e28-724f-46cf-b3f4-41b189c4f46d', '9453e34c-6e0f-4343-8bf1-422b6a9f4de1', 'Хорошего дня',            '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-04-01 09:00:00'),
    ('9146b520-64e5-4c1e-b487-09c1ab95b10f', '8513bf26-3f7a-4574-b2fd-164e83238c47', 'Всего доброго',           '4c6a8dda-f4f2-4981-8a01-c314115828f6', 'Bronislav', '2024-04-05 09:00:00'),
    ('8aee70e4-1083-41c1-892f-8a70a8d5437d', 'dbbf8a89-0fd1-4c87-b1ae-84724d845775', 'До свидания',             '8513be2f-c6bd-4ffd-83ef-d03773756e53', 'Cobron', '2024-04-10 09:00:00'),
    ('7a1545f3-cd85-44d1-9a17-02d5b2d58839', '9e40b5f3-39c2-408c-97a8-03b4ca64d671', 'Пока',                    '9453e047-a56b-42f6-95a5-328b8a22841e', 'denchik', '2024-04-15 09:00:00');